<a href="https://colab.research.google.com/github/Ikunalk4/ml/blob/main/10_decision_tree.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('https://raw.githubusercontent.com/codebasics/py/master/ML/9_decision_tree/salaries.csv')
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [5]:
inputs = df.drop('salary_more_then_100k',axis='columns')
inputs

       company                  job     degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive    masters
7   abc pharma  computer programmer  bachelors
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters

In [19]:
from sklearn.preprocessing import LabelEncoder
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [24]:
inputs['company_n'] = le_company.fit_transform(inputs['company'])
inputs['job_n'] = le_job.fit_transform(inputs['job'])
inputs['degree_n'] = le_degree.fit_transform(inputs['degree'])

In [25]:
inputs

       company                  job     degree  company_n  degree_n  job_n
0       google      sales executive  bachelors          2         0      2
1       google      sales executive    masters          2         1      2
2       google     business manager  bachelors          2         0      0
3       google     business manager    masters          2         1      0
4       google  computer programmer  bachelors          2         0      1
5       google  computer programmer    masters          2         1      1
6   abc pharma      sales executive    masters          0         1      2
7   abc pharma  computer programmer  bachelors          0         0      1
8   abc pharma     business manager  bachelors          0         0      0
9   abc pharma     business manager    masters          0         1      0
10    facebook      sales executive  bachelors          1         0      2
11    facebook      sales executive    masters          1         1      2
12    facebook     business manager  bachelors          1         0      0
13    facebook     business manager    masters          1         1      0
14    facebook  computer programmer  bachelors          1         0      1
15    facebook  computer programmer    masters          1         1      1

In [10]:
inputs_n = inputs.drop(['company','job','degree'],axis='columns')
inputs_n

    company_n  degree_n  job_n
0           2         0      2
1           2         1      2
2           2         0      0
3           2         1      0
4           2         0      1
5           2         1      1
6           0         1      2
7           0         0      1
8           0         0      0
9           0         1      0
10          1         0      2
11          1         1      2
12          1         0      0
13          1         1      0
14          1         0      1
15          1         1      1

In [12]:
target = df['salary_more_then_100k']

In [1]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [13]:
model.fit(inputs_n,target)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [14]:
model.score(inputs_n,target)

1.0

In [26]:
model.predict([[2,0,1]])

array([0])

In [27]:
model.predict([[2,1,0]])

array([1])